{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "1st_set_1st_conv_3x3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1st_set_1st_conv_3x3", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1st_set_2nd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1st_set_2nd_conv_3x3", "inbound_nodes": [[["1st_set_1st_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "1st_set_3rd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "1st_set_3rd_conv_3x3", "inbound_nodes": [[["1st_set_2nd_conv_3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "1st_max_pooling", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "1st_max_pooling", "inbound_nodes": [[["1st_set_3rd_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "2nd_set_1st_conv_3x3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "2nd_set_1st_conv_3x3", "inbound_nodes": [[["1st_max_pooling", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "2nd_set_2nd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "2nd_set_2nd_conv_3x3", "inbound_nodes": [[["2nd_set_1st_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "2nd_set_3rd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "2nd_set_3rd_conv_3x3", "inbound_nodes": [[["2nd_set_2nd_conv_3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "2nd_max_pooling", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "2nd_max_pooling", "inbound_nodes": [[["2nd_set_3rd_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "3rd_set_1st_conv_3x3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "3rd_set_1st_conv_3x3", "inbound_nodes": [[["2nd_max_pooling", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "3rd_set_2nd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "3rd_set_2nd_conv_3x3", "inbound_nodes": [[["3rd_set_1st_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "3rd_set_3rd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "3rd_set_3rd_conv_3x3", "inbound_nodes": [[["3rd_set_2nd_conv_3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "3rd_max_pooling", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "3rd_max_pooling", "inbound_nodes": [[["3rd_set_3rd_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "4th_set_1st_conv_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "4th_set_1st_conv_3x3", "inbound_nodes": [[["3rd_max_pooling", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "4th_set_2nd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "4th_set_2nd_conv_3x3", "inbound_nodes": [[["4th_set_1st_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "4th_set_3rd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "4th_set_3rd_conv_3x3", "inbound_nodes": [[["4th_set_2nd_conv_3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "4th_max_pooling", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "4th_max_pooling", "inbound_nodes": [[["4th_set_3rd_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "5th_set_1st_conv_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "5th_set_1st_conv_3x3", "inbound_nodes": [[["4th_max_pooling", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "5th_set_2nd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "5th_set_2nd_conv_3x3", "inbound_nodes": [[["5th_set_1st_conv_3x3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "5th_set_3rd_conv_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "5th_set_3rd_conv_3x3", "inbound_nodes": [[["5th_set_2nd_conv_3x3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "features_vector", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "features_vector", "inbound_nodes": [[["5th_set_3rd_conv_3x3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "sigmoid_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "sigmoid_output", "inbound_nodes": [[["features_vector", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["sigmoid_output", 0, 0]]}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1, "fn": "binary_crossentropy"}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}, {"class_name": "AUC", "config": {"name": "auc", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}}, {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0007659283000975847, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "1st_set_1st_conv_3x3/kernel", "shape": [3, 3, 3, 4], "dtype": "float32"}, {"name": "1st_set_1st_conv_3x3/bias", "shape": [4], "dtype": "float32"}, {"name": "1st_set_2nd_conv_3x3/kernel", "shape": [3, 3, 4, 4], "dtype": "float32"}, {"name": "1st_set_2nd_conv_3x3/bias", "shape": [4], "dtype": "float32"}, {"name": "1st_set_3rd_conv_3x3/kernel", "shape": [3, 3, 4, 4], "dtype": "float32"}, {"name": "1st_set_3rd_conv_3x3/bias", "shape": [4], "dtype": "float32"}, {"name": "2nd_set_1st_conv_3x3/kernel", "shape": [3, 3, 4, 8], "dtype": "float32"}, {"name": "2nd_set_1st_conv_3x3/bias", "shape": [8], "dtype": "float32"}, {"name": "2nd_set_2nd_conv_3x3/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "2nd_set_2nd_conv_3x3/bias", "shape": [8], "dtype": "float32"}, {"name": "2nd_set_3rd_conv_3x3/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "2nd_set_3rd_conv_3x3/bias", "shape": [8], "dtype": "float32"}, {"name": "3rd_set_1st_conv_3x3/kernel", "shape": [3, 3, 8, 16], "dtype": "float32"}, {"name": "3rd_set_1st_conv_3x3/bias", "shape": [16], "dtype": "float32"}, {"name": "3rd_set_2nd_conv_3x3/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "3rd_set_2nd_conv_3x3/bias", "shape": [16], "dtype": "float32"}, {"name": "3rd_set_3rd_conv_3x3/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "3rd_set_3rd_conv_3x3/bias", "shape": [16], "dtype": "float32"}, {"name": "4th_set_1st_conv_3x3/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "4th_set_1st_conv_3x3/bias", "shape": [32], "dtype": "float32"}, {"name": "4th_set_2nd_conv_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "4th_set_2nd_conv_3x3/bias", "shape": [32], "dtype": "float32"}, {"name": "4th_set_3rd_conv_3x3/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "4th_set_3rd_conv_3x3/bias", "shape": [32], "dtype": "float32"}, {"name": "5th_set_1st_conv_3x3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "5th_set_1st_conv_3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "5th_set_2nd_conv_3x3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "5th_set_2nd_conv_3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "5th_set_3rd_conv_3x3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "5th_set_3rd_conv_3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "sigmoid_output/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "sigmoid_output/bias", "shape": [1], "dtype": "float32"}]}]}